VPro/src/Documents/LoanContract/LoanContract.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoanContract</name>
  <basedOn>Catalog.Employees</basedOn>
  <registerRecords>InformationRegister.LoanRepaymentSchedule</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>LoanKind</name>
    <type>
      <types>EnumRef.LoanContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Total</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InterestRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ChargeFromSalary</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RepaymentOption</name>
    <type>
      <types>EnumRef.OptionsOfLoanRepaymentByEmployee</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Maturity</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FirstRepayment</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessArea</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>InterestGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CostAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionType</name>
    <type>
      <types>EnumRef.LoanCommissionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Commission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaymentTerms</name>
    <type>
      <types>EnumRef.LoanRepaymentTerms</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Order</name>
    <type>
      <types>DocumentRef.CustomerOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>DeductionPrincipalDebt</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DeductionInterest</name>
    <type>
      <types>CatalogRef.AccrualAndDeductionKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysInYear360</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PaymentAndAccrualSchedule</name>
    <attributes>
      <name>PaymentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Principal</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Interest</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Commission</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/Enums/LoanContractTypes/LoanContractTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanContractTypes</name>
  <enumValues>
    <name>EmployeeLoanAgreement</name>
  </enumValues>
  <enumValues>
    <name>Borrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/LoanCommissionTypes/LoanCommissionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanCommissionTypes</name>
  <enumValues>
    <name>No</name>
  </enumValues>
  <enumValues>
    <name>AmountPerMonth</name>
  </enumValues>
  <enumValues>
    <name>PercentOfPrincipal</name>
  </enumValues>
  <enumValues>
    <name>PercentOfPrincipalBalance</name>
  </enumValues>
  <enumValues>
    <name>CustomSchedule</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/GLAccountsTypes/GLAccountsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>GLAccountsTypes</name>
  <enumValues>
    <name>DepreciationFixedAssets</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>FixedAssets</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>AccountsGroup</name>
    <comment>Service</comment>
  </enumValues>
  <enumValues>
    <name>Debitors</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>CashAssets</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>LongtermObligations</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Incomings</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Inventory</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Capital</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>IndirectExpenses</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>ShorttermInvestments</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Creditors</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>Loans</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>ProfitTax</name>
  </enumValues>
  <enumValues>
    <name>UnfinishedProduction</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>UndistributedProfit</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ProfitLosses</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>LoanInterest</name>
  </enumValues>
  <enumValues>
    <name>OtherFixedAssets</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>OtherIncome</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>OtherShorttermObligations</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>OtherCurrentAssets</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>OtherExpenses</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Expenses</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>ReserveAndAdditionalCapital</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>CostOfGoodsSold</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>TradeMarkup</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Documents/LoanContract/ObjectModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

#Region EventHandlers

// Procedure - handler of the PopulationProcessing event of the object.
//
Procedure Filling(FillingData, StandardProcessing)
	
	If TypeOf(FillingData) = Type("CatalogRef.Employees") Then
		
		Employee = FillingData;
		LoanKind = Enums.LoanContractTypes.EmployeeLoanAgreement;
		
	ElsIf TypeOf(FillingData) = Type("Structure") Then
		
		If FillingData.Property("Employee") AND 
			ValueIsFilled(FillingData.Employee) Then
			
			Employee = FillingData;
			Counterparty = Catalogs.Counterparties.EmptyRef();
			LoanKind = Enums.LoanContractTypes.EmployeeLoanAgreement;
			
		EndIf;
		
		If FillingData.Property("Counterparty") AND
			ValueIsFilled(FillingData.Counterparty) Then
			
			Employee = Catalogs.Employees.EmptyRef();
			Counterparty = FillingData.Counterparty;
			LoanKind = Enums.LoanContractTypes.Borrowed;
			
		EndIf;
		
	EndIf;
	
	ObjectFillingSB.FillDocument(ThisObject, FillingData);
	
EndProcedure // PopulationProcessing()

// Procedure - handler of the BeforeWriting event of the object.
//
Procedure BeforeWrite(Cancel, WriteMode, PostingMode)
	
	If DataExchange.Load Then
		Return;
	EndIf;

	If LoanKind = Enums.LoanContractTypes.EmployeeLoanAgreement Then
		Counterparty = Undefined;
	Else
		Employee = Undefined;
		ChargeFromSalary = False;
	EndIf;
	
EndProcedure // BeforeWriting()

// Procedure - handler of the PostingProcessing event.
//
Procedure Posting(Cancel, PostingMode)
	
	// Initialization of additional properties to post the document.
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Document data initialization.
	Documents.LoanContract.InitializeDocumentData(Ref, AdditionalProperties);
	
	// Prepare record sets.
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);

	SmallBusinessServer.RecordLoanRepaymentSchedule(AdditionalProperties, RegisterRecords, Cancel);
	
	// Record of record sets.
	SmallBusinessServer.WriteRecordSets(ThisObject);
	
	AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
	
EndProcedure // PostingProcessing()

// Procedure - handler of the PopulationCheckProcessing event.
//
Procedure FillCheckProcessing(Cancel, AttributesToCheck)
	
	If LoanKind = Enums.LoanContractTypes.EmployeeLoanAgreement Then
		
		SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "Counterparty");
		SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "CommissionGLAccount");
		SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "CommissionType");
		
	Else
		
		SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "Employee");
		If CommissionType = Enums.LoanCommissionTypes.No Then
			SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "CommissionGLAccount");
		EndIf;
		
	EndIf;
	
	If GLAccount.TypeOfAccount <> Enums.GLAccountsTypes.Expenses AND
		CommissionGLAccount.TypeOfAccount <> Enums.GLAccountsTypes.Expenses AND
		InterestGLAccount.TypeOfAccount <> Enums.GLAccountsTypes.Expenses 
	Then
		SmallBusinessServer.DeleteAttributeBeingChecked(AttributesToCheck, "StructuralUnit");
	EndIf;
	
EndProcedure

// Procedure - handler of the PostingDeletionProcessing of the object event.
//
Procedure UndoPosting(Cancel)
	
	// Initialization of additional properties to post the document
	SmallBusinessServer.InitializeAdditionalPropertiesForPosting(Ref, AdditionalProperties);
	
	// Prepare record sets
	SmallBusinessServer.PrepareRecordSetsForRecording(ThisObject);
	
	// Record of record sets
	SmallBusinessServer.WriteRecordSets(ThisObject);

EndProcedure

#EndRegion

#EndIf
